; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v1 - type_1 ?v7 - type_3)
 	      (pred_2 ?v8 - object ?v7 - type_3)
	      (pred_3 ?v1 - type_1 ?v5 - type_2)
	      (pred_1 ?v1 - type_1 ?v8 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v3 ?v6 - type_3)
       :precondition (and  (pred_4 ?v1 ?v3))
       :effect (and  (pred_4 ?v1 ?v6)
		     (not (pred_4 ?v1 ?v3))))

   (:action op_1
       :parameters (?v1 - type_1 ?v2 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v4) (pred_4 ?v1 ?v4) (pred_3 ?v1 ?v5))
       :effect (and (pred_1 ?v1 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v4)) 
		    (not (pred_3 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_1 ?v2 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v2 ?v5) (pred_4 ?v1 ?v4))
       :effect (and (pred_2 ?v2 ?v4)
		    (pred_3 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v2 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_09 - type_1
obj_12 obj_07 obj_03 obj_08 - type_2
obj_02 obj_05 obj_11 - type_3
obj_10 obj_04 obj_01 - object)
(:init
(pred_4 obj_06 obj_11)
(pred_3 obj_06 obj_12)
(pred_3 obj_06 obj_07)
(pred_4 obj_09 obj_02)
(pred_3 obj_09 obj_03)
(pred_3 obj_09 obj_08)
(pred_2 obj_10 obj_05)
(pred_2 obj_04 obj_02)
(pred_2 obj_01 obj_11)
)
(:goal
(and
(pred_2 obj_10 obj_02)
(pred_2 obj_04 obj_02)
(pred_2 obj_01 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_06 obj_05) (pred_4 obj_09 obj_05))))
  )
)
)

; plan
1. (op_1 obj_06 obj_01 obj_11 obj_07)
   deleted: (pred_2 obj_01 obj_11) (pred_3 obj_06 obj_07)
   added: (pred_1 obj_06 obj_01 obj_07)
   goals met: 1 of 3
2. (op_3 obj_06 obj_11 obj_05)
   deleted: (pred_4 obj_06 obj_11)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
3. (op_2 obj_06 obj_01 obj_05 obj_07)
   deleted: (pred_1 obj_06 obj_01 obj_07)
   added: (pred_2 obj_01 obj_05) (pred_3 obj_06 obj_07)
   goals met: 2 of 3
4. (op_1 obj_06 obj_10 obj_05 obj_07)
   deleted: (pred_2 obj_10 obj_05) (pred_3 obj_06 obj_07)
   added: (pred_1 obj_06 obj_10 obj_07)
   goals met: 2 of 3
5. (op_3 obj_06 obj_05 obj_02)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_02)
   goals met: 2 of 3
6. (op_2 obj_06 obj_10 obj_02 obj_07)
   deleted: (pred_1 obj_06 obj_10 obj_07)
   added: (pred_2 obj_10 obj_02) (pred_3 obj_06 obj_07)
   goals met: 3 of 3
